ghsecuritylab/STM32F7Cube/Projects/STM32746G-Discovery/Applications/USB_Device/HID_Standalone/Src/main.c
//{{{
static void IntToUnicode (uint32_t value , uint8_t *pbuf , uint8_t len) {
  uint8_t idx = 0;

  for( idx = 0 ; idx < len ; idx ++)
  {
    if( ((value >> 28)) < 0xA )
    {
      pbuf[ 2* idx] = (value >> 28) + '0';
    }
    else
    {
      pbuf[2* idx] = (value >> 28) + 'A' - 10;
    }

    value = value << 4;

    pbuf[ 2* idx + 1] = 0;
  }
}
//}}}
//{{{
static void Get_SerialNum() {
  uint32_t deviceserial0, deviceserial1, deviceserial2;

  deviceserial0 = *(uint32_t*)DEVICE_ID1;
  deviceserial1 = *(uint32_t*)DEVICE_ID2;
  deviceserial2 = *(uint32_t*)DEVICE_ID3;

  deviceserial0 += deviceserial2;

  if (deviceserial0 != 0)
  {
    IntToUnicode (deviceserial0, &USBD_StringSerial[2] ,8);
    IntToUnicode (deviceserial1, &USBD_StringSerial[18] ,4);
  }
}
//}}}

//{{{
uint8_t* hidDeviceDescriptor (USBD_SpeedTypeDef speed, uint16_t *length) {
  *length = sizeof(USBD_DeviceDesc);
  return (uint8_t*)USBD_DeviceDesc;
  }
//}}}
//{{{
uint8_t* hidLangIDStrDescriptor (USBD_SpeedTypeDef speed, uint16_t *length) {
  *length = sizeof(USBD_LangIDDesc);
  return (uint8_t*)USBD_LangIDDesc;
  }
//}}}
//{{{
uint8_t* hidProductStrDescriptor (USBD_SpeedTypeDef speed, uint16_t *length) {
  USBD_GetString ((uint8_t*)USBD_PRODUCT_FS_STRING, USBD_StrDesc, length);
  return USBD_StrDesc;
  }
//}}}
//{{{
uint8_t* hidManufacturerStrDescriptor (USBD_SpeedTypeDef speed, uint16_t *length) {
  USBD_GetString ((uint8_t*)USBD_MANUFACTURER_STRING, USBD_StrDesc, length);
  return USBD_StrDesc;
  }
//}}}
//{{{
uint8_t* hidSerialStrDescriptor (USBD_SpeedTypeDef speed, uint16_t *length) {
  *length = USB_SIZ_STRING_SERIAL;
  Get_SerialNum();
  return (uint8_t*)USBD_StringSerial;
  }
//}}}
//{{{
uint8_t* hidConfigStrDescriptor (USBD_SpeedTypeDef speed, uint16_t *length) {
  USBD_GetString ((uint8_t*)USBD_CONFIGURATION_FS_STRING, USBD_StrDesc, length);
  return USBD_StrDesc;
  }
//}}}
//{{{
uint8_t* hidInterfaceStrDescriptor (USBD_SpeedTypeDef speed, uint16_t *length) {
  USBD_GetString ((uint8_t*)USBD_INTERFACE_FS_STRING, USBD_StrDesc, length);
  return USBD_StrDesc;
  }

//}}}

USBD_DescriptorsTypeDef hidDescriptor = {
  hidDeviceDescriptor,
  hidLangIDStrDescriptor,
  hidManufacturerStrDescriptor,
  hidProductStrDescriptor,
  hidSerialStrDescriptor,
  hidConfigStrDescriptor,
  hidInterfaceStrDescriptor,
  };
//}}}
//{{{  hid handlers
typedef enum { HID_IDLE = 0, HID_BUSY, } hidStateTypeDef;
//{{{  tHidData
typedef struct {
  uint32_t        Protocol;
  uint32_t        IdleState;
  uint32_t        AltSetting;
  hidStateTypeDef state;
  } tHidData;
//}}}

//{{{  defines
#define HID_EPIN_ADDR                0x81
#define HID_EPIN_SIZE                0x04

#define HID_DESCRIPTOR_TYPE          0x21
#define HID_REPORT_DESC              0x22
#define HID_HS_BINTERVAL             0x07
#define HID_FS_BINTERVAL             0x0A
#define HID_POLLING_INTERVAL         0x0A
#define HID_REQ_SET_PROTOCOL         0x0B
#define HID_REQ_GET_PROTOCOL         0x03
#define HID_REQ_SET_IDLE             0x0A
#define HID_REQ_GET_IDLE             0x02
#define HID_REQ_SET_REPORT           0x09
#define HID_REQ_GET_REPORT           0x01
//}}}
//{{{
/* USB HID device Configuration Descriptor */
__ALIGN_BEGIN static const uint8_t hidCfgDesc[34] __ALIGN_END =
{
  0x09, /* bLength: Configuration Descriptor size */
  USB_DESC_TYPE_CONFIGURATION, /* bDescriptorType: Configuration */
  34, /* wTotalLength: Bytes returned */
  0x00,
  0x01,         /*bNumInterfaces: 1 interface*/
  0x01,         /*bConfigurationValue: Configuration value*/
  0x00,         /*iConfiguration: Index of string descriptor describing
  the configuration*/
  0xE0,         /*bmAttributes: bus powered and Support Remote Wake-up */
  0x32,         /*MaxPower 100 mA: this current is used for detecting Vbus*/

  /************** Descriptor of Joystick Mouse interface ****************/
  0x09,         /*bLength: Interface Descriptor size*/
  USB_DESC_TYPE_INTERFACE,/*bDescriptorType: Interface descriptor type*/
  0x00,         /*bInterfaceNumber: Number of Interface*/
  0x00,         /*bAlternateSetting: Alternate setting*/
  0x01,         /*bNumEndpoints*/
  0x03,         /*bInterfaceClass: HID*/
  0x01,         /*bInterfaceSubClass : 1=BOOT, 0=no boot*/
  0x02,         /*nInterfaceProtocol : 0=none, 1=keyboard, 2=mouse*/
  0,            /*iInterface: Index of string descriptor*/

  /******************** Descriptor of Joystick Mouse HID ********************/
  0x09,         /*bLength: HID Descriptor size*/
  HID_DESCRIPTOR_TYPE, /*bDescriptorType: HID*/
  0x11,         /*bcdHID: HID Class Spec release number*/
  0x01,
  0x00,         /*bCountryCode: Hardware target country*/
  0x01,         /*bNumDescriptors: Number of HID class descriptors to follow*/
  0x22,         /*bDescriptorType*/
  74,/*wItemLength: Total length of Report descriptor*/
  0x00,

  /******************** Descriptor of Mouse endpoint ********************/
  0x07,          /*bLength: Endpoint Descriptor size*/
  USB_DESC_TYPE_ENDPOINT, /*bDescriptorType:*/

  HID_EPIN_ADDR,     /*bEndpointAddress: Endpoint Address (IN)*/
  0x03,          /*bmAttributes: Interrupt endpoint*/
  HID_EPIN_SIZE, /*wMaxPacketSize: 4 Byte max */
  0x00,
  HID_FS_BINTERVAL,          /*bInterval: Polling Interval (10 ms)*/
  };
//}}}
//{{{
/* USB HID device Configuration Descriptor */
__ALIGN_BEGIN static const uint8_t hidDesc[9] __ALIGN_END = {
  /* 18 */
  0x09,         /*bLength: HID Descriptor size*/
  HID_DESCRIPTOR_TYPE, /*bDescriptorType: HID*/
  0x11,         /*bcdHID: HID Class Spec release number*/
  0x01,
  0x00,         /*bCountryCode: Hardware target country*/
  0x01,         /*bNumDescriptors: Number of HID class descriptors to follow*/
  0x22,         /*bDescriptorType*/
  74,/*wItemLength: Total length of Report descriptor*/
  0x00,
  };
//}}}
//{{{
/* USB Standard Device Descriptor */
__ALIGN_BEGIN static const uint8_t hidDeviceQualifierDesc[USB_LEN_DEV_QUALIFIER_DESC] __ALIGN_END = {
  USB_LEN_DEV_QUALIFIER_DESC,
  USB_DESC_TYPE_DEVICE_QUALIFIER,
  0x00,
  0x02,
  0x00,
  0x00,
  0x00,
  0x40,
  0x01,
  0x00,
  };
//}}}
//{{{
__ALIGN_BEGIN static const uint8_t hidMOUSE_ReportDesc[74] __ALIGN_END = {
  0x05,   0x01,
  0x09,   0x02,
  0xA1,   0x01,
  0x09,   0x01,

